# DQL

In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:123456@localhost:3306/world

> 数据查询

&emsp;&emsp;<b/>查询关键字: <span style="color: red;"/>SELECT </span></b>

##  DQL语法

<pre>
            SELECT
                字段列表
            FROM
                表名列表
            WHERE
                条件列表
            GROUP BY
                分组字段列表
            HAVING
                分组后的条件列表
            ORDER BY
                排序字段列表
            LIMIT
                分页参数
<pre>

* 基本查询
* 条件查询 (<span style="color: red;">WHERE</span>)
* 聚合函数 (<span style="color: red;">count、max、min、avg、sum</span>)
* 分组查询 (<span style="color: red;">GROUP BY</span>)
* 排序查询 (<span style="color: red;">ORDER BY</span>)
* 分页查询 (<span style="color: red;">LIMIT</span>)

## 基本查询

### 1. 查询多个字段

In [2]:
%%sql
-- DESC city;
SELECT 
    ID, Name, Population 
FROM 
    city
WHERE Name like 'Ch%n';

 * mysql+mysqlconnector://root:***@localhost:3306/world
9 rows affected.

[(566, 'Chillán', 178182),
 (1900, 'Changchun', 2812000),
 (2320, 'Chongjin', 582480),
 (2347, 'Chang-won', 481694),
 (2350, 'Chonan', 330259),
 (2365, 'Chunchon', 234528),
 (2381, 'Chechon', 137070),
 (2544, 'Chimalhuacán', 490245),
 (4066, 'Charleston', 89063)]

### 2. 查询所有字段

In [6]:
%%sql
-- SELECT 
--     * 
-- FROM 
--     city;

 * mysql+mysqlconnector://root:***@localhost:3306/world
0 rows affected.

[]

### 3. 查询所有城市名称,  并起别名

In [7]:
%%sql
-- SELECT 
--     Name AS city_name
-- FROM 
--     city;

 * mysql+mysqlconnector://root:***@localhost:3306/world
0 rows affected.

[]

In [12]:
%%sql
-- desc country;
SELECT
    DISTINCT Continent '大洲'
FROM   
    country;

 * mysql+mysqlconnector://root:***@localhost:3306/world
7 rows affected.

[('North America',),
 ('Asia',),
 ('Africa',),
 ('Europe',),
 ('South America',),
 ('Oceania',),
 ('Antarctica',)]

## 条件查询

![DQL-条件查询](./image/DQL-条件查询.jpg)

### 1. 查询Population大于某值的城市

In [19]:
%%sql
SELECT
    Name, Population
FROM
    city
WHERE 
    Population > 9000000;

 * mysql+mysqlconnector://root:***@localhost:3306/world
6 rows affected.

[('São Paulo', 9968485),
 ('Jakarta', 9604900),
 ('Mumbai (Bombay)', 10500000),
 ('Shanghai', 9696300),
 ('Seoul', 9981619),
 ('Karachi', 9269265)]

### 2. 查询在指定范围内

In [23]:
%%sql
sELECT
    Name, Population
FROM
    city
WHERE
    Population BETWEEN 8000000 AND 9000000;

 * mysql+mysqlconnector://root:***@localhost:3306/world
4 rows affected.

[('Ciudad de México', 8591309),
 ('Istanbul', 8787958),
 ('Moscow', 8389200),
 ('New York', 8008278)]

### 3. NULL查询

In [28]:
%%sql
SELECT
    Name, IndepYear
FROM
    country
WHERE
    IndepYear IS NULL AND Population < 800000 AND Name LIKE "a%";

 * mysql+mysqlconnector://root:***@localhost:3306/world
4 rows affected.

[('Aruba', None),
 ('Anguilla', None),
 ('American Samoa', None),
 ('Antarctica', None)]

### 4. 查询字母数为指定长度的城市

In [30]:
%%sql
SELECT
    Name, Population
FROM
    city
WHERE
    LENGTH(Name) = 5  AND Population > 3000000;

 * mysql+mysqlconnector://root:***@localhost:3306/world
7 rows affected.

[('Dhaka', 3612850),
 ('Cairo', 6789479),
 ('Delhi', 7206704),
 ('Tokyo', 7980230),
 ('Wuhan', 4344600),
 ('Seoul', 9981619),
 ('Pusan', 3804522)]

## 聚合函数

<center/><img src='./image/DQL-聚合函数.jpg' width="60%" >

### 1. 统计国家数量

In [39]:
%%sql
SELECT
    COUNT(*) COUNT
FROM
    country;

 * mysql+mysqlconnector://root:***@localhost:3306/world
1 rows affected.

[(239,)]

In [40]:
%%sql
SELECT
    COUNT(IndepYear) COUNT
FROM
    country;

 * mysql+mysqlconnector://root:***@localhost:3306/world
1 rows affected.

[(192,)]

>  <span style="color: red;"/>NULL 不参与聚合函数的统计</span>

### 2. 统计所有国家的平均、最大、最小、总人数

In [36]:
%%sql
SELECT
    AVG(Population) AVG, MAX(Population) MAX, MIN(Population) MIN, SUM(Population) SUM
FROM
    country;

 * mysql+mysqlconnector://root:***@localhost:3306/world
1 rows affected.

[(Decimal('25434098.1172'), 1277558000, 0, Decimal('6078749450'))]

### 3. 统计亚洲国家的平均、最大、最小、总人数

In [38]:
%%sql
SELECT
    AVG(Population) AVG, MAX(Population) MAX, MIN(Population) MIN, SUM(Population) SUM
FROM
    country
WHERE
    Continent = "Asia";

 * mysql+mysqlconnector://root:***@localhost:3306/world
1 rows affected.

[(Decimal('72647562.7451'), 1277558000, 286000, Decimal('3705025700'))]

## 分组查询

![分组查询](./image/DQL-分组查询.jpg)

### 1. 分组查询各大洲国家数量和总人数

In [44]:
%%sql
SELECT
    continent, COUNT(Name) COUNT, SUM(Population) SUM
FROM
    country
GROUP BY
    continent;

 * mysql+mysqlconnector://root:***@localhost:3306/world
7 rows affected.

[('North America', 37, Decimal('482993000')),
 ('Asia', 51, Decimal('3705025700')),
 ('Africa', 58, Decimal('784475000')),
 ('Europe', 46, Decimal('730074600')),
 ('South America', 14, Decimal('345780000')),
 ('Oceania', 28, Decimal('30401150')),
 ('Antarctica', 5, Decimal('0'))]

### 2. 分组查询各大洲人数超过五千万的国家数量

In [47]:
%%sql
SELECT
    continent, COUNT(Name) COUNT, SUM(Population) SUM
FROM
    country
WHERE
    Population > 50000000
GROUP BY
    continent
ORDER BY
    COUNT

 * mysql+mysqlconnector://root:***@localhost:3306/world
5 rows affected.

[('South America', 1, Decimal('170115000')),
 ('North America', 2, Decimal('377238000')),
 ('Africa', 4, Decimal('294195000')),
 ('Europe', 6, Decimal('456083800')),
 ('Asia', 11, Decimal('3267170000'))]

### 3. 分组后查询总人口超过5亿人的大洲

In [50]:
%%sql
SELECT
    continent, COUNT(Name) COUNT, SUM(Population) SUM
FROM
    country
GROUP BY
    continent
HAVING
    SUM(Population) > 500000000
ORDER BY
    COUNT;

 * mysql+mysqlconnector://root:***@localhost:3306/world
3 rows affected.

[('Europe', 46, Decimal('730074600')),
 ('Asia', 51, Decimal('3705025700')),
 ('Africa', 58, Decimal('784475000'))]

### 4. 分组后查询每个大洲 人数大于五千万的国家 数量超过5的大洲

In [55]:
%%sql
SELECT
    continent, COUNT(Name) COUNT, SUM(Population) SUM
FROM
    country
WHERE
    Population > 50000000
GROUP BY
    continent
HAVING
    COUNT(Name) > 5
ORDER BY
    COUNT;

 * mysql+mysqlconnector://root:***@localhost:3306/world
2 rows affected.

[('Europe', 6, Decimal('456083800')), ('Asia', 11, Decimal('3267170000'))]

## 排序查询

![排序查询](./image/DQL-排序.jpg)

### 1. 根据人数对北美洲国家进行升序和降序排序(人数大于5000w万的国家)

> 升序

In [57]:
%%sql
SELECT
    Name, Population
FROM
    country
WHERE
    continent = "North America" AND Population > 50000000
ORDER BY
    Population ASC;

 * mysql+mysqlconnector://root:***@localhost:3306/world
2 rows affected.

[('Mexico', 98881000), ('United States', 278357000)]

> 降序

In [58]:
%%sql
SELECT
    Name, Population
FROM
    country
WHERE
    continent = "North America" AND Population > 50000000
ORDER BY
    Population DESC;

 * mysql+mysqlconnector://root:***@localhost:3306/world
2 rows affected.

[('United States', 278357000), ('Mexico', 98881000)]

### 2. 先根据独立年份进行升序排序, 再根据人数降序排序

In [72]:
%%sql
SELECT
    Name 国家,continent 洲, IndepYear 独立年份, Population 人口
FROM
    country
WHERE
    continent = "North America" AND Population > 3000000 AND IndepYear IS NOT NULL
ORDER BY
    IndepYear ASC, Population DESC;

 * mysql+mysqlconnector://root:***@localhost:3306/world
11 rows affected.

[('United States', 'North America', 1776, 278357000),
 ('Haiti', 'North America', 1804, 8222000),
 ('Mexico', 'North America', 1810, 98881000),
 ('Guatemala', 'North America', 1821, 11385000),
 ('Costa Rica', 'North America', 1821, 4023000),
 ('Honduras', 'North America', 1838, 6485000),
 ('Nicaragua', 'North America', 1838, 5074000),
 ('El Salvador', 'North America', 1841, 6276000),
 ('Dominican Republic', 'North America', 1844, 8495000),
 ('Canada', 'North America', 1867, 31147000),
 ('Cuba', 'North America', 1902, 11201000)]

## 分页查询

![](./image/DQL-分页查询.jpg)

### 1. 查询第一页国家信息, 每页展示10条记录(全部数据按人口降序排序)

In [78]:
%%sql
SELECT
    Name 国家,continent 洲, Population 人口
FROM
    country
ORDER BY
    Population DESC
LIMIT
    10;

 * mysql+mysqlconnector://root:***@localhost:3306/world
10 rows affected.

[('China', 'Asia', 1277558000),
 ('India', 'Asia', 1013662000),
 ('United States', 'North America', 278357000),
 ('Indonesia', 'Asia', 212107000),
 ('Brazil', 'South America', 170115000),
 ('Pakistan', 'Asia', 156483000),
 ('Russian Federation', 'Europe', 146934000),
 ('Bangladesh', 'Asia', 129155000),
 ('Japan', 'Asia', 126714000),
 ('Nigeria', 'Africa', 111506000)]

### 2. 查询第二页国家信息, 每页展示10条记录(全部数据按人口降序排序)

In [79]:
%%sql
SELECT
    Name 国家,continent 洲, Population 人口
FROM
    country
ORDER BY
    Population DESC
LIMIT
    10, 10;

 * mysql+mysqlconnector://root:***@localhost:3306/world
10 rows affected.

[('Mexico', 'North America', 98881000),
 ('Germany', 'Europe', 82164700),
 ('Vietnam', 'Asia', 79832000),
 ('Philippines', 'Asia', 75967000),
 ('Egypt', 'Africa', 68470000),
 ('Iran', 'Asia', 67702000),
 ('Turkey', 'Asia', 66591000),
 ('Ethiopia', 'Africa', 62565000),
 ('Thailand', 'Asia', 61399000),
 ('United Kingdom', 'Europe', 59623400)]

## 执行顺序

![](./image/DQL-执行顺序.jpg)

In [85]:
%%sql
SELECT
    c.Name 国家, c.continent 洲, IndepYear 独立年份, Population 人口
FROM
    country c
WHERE
    c.continent = "North America" AND Population > 300000 AND IndepYear IS NOT NULL
ORDER BY
    独立年份 ASC, Population DESC
LIMIT
    10, 10;

 * mysql+mysqlconnector://root:***@localhost:3306/world
5 rows affected.

[('Cuba', 'North America', 1902, 11201000),
 ('Panama', 'North America', 1903, 2856000),
 ('Jamaica', 'North America', 1962, 2583000),
 ('Trinidad and Tobago', 'North America', 1962, 1295000),
 ('Bahamas', 'North America', 1973, 307000)]

## 总结

<a herf=' https://b23.tv/F9eeBz0'/>黑马程序员MySQL</a>

<img src='./image/DQL-总结.jpg' width="70%">